<%@ page language="java" contentType="text/html;charset=UTF-8" pageEncoding="UTF-8"
%><%@page import="com.ibleaders.ibchart.Down2Image"%><%
    
    Down2Image ibChart = new Down2Image(request, response);

    //====================================================================================================
    // [ 사용자 환경 설정 #1 ]
    //====================================================================================================
    // Html 페이지의 엔코딩이 UTF-8 로 구성되어 있으면 "ibChart.setPageEncoding("UTF-8");" 로 설정합니다.
    // 다운로드 받는 이미지에 한글이 깨지면 이 값을 공백("")으로 바꿔 보십시오.
    // 웹페이지의 charset 과 동일해야 한글이 깨지지 않습니다.
    //====================================================================================================
    ibChart.setPageEncoding("UTF-8");

    //====================================================================================================
    // [ 사용자 환경 설정 #2 ]
    //====================================================================================================
    // HML 파일의 가로 여부를 설정 합니다.
    // 기본 값은 true이며 가로는 true, 세로는 false로 설정 하세요.
    //====================================================================================================
    //ibChart.setLandscape(true);


    // 생성된 이미지를 브라우저를 통해 다운로드
    ibChart.down2Image();
    
	// 생성된 이미지를 서버 특정 폴더에 저장합니다.
    //ibChart.saveImage("d:/down/");

%>