<SHEET>
	<DATA COLSEPARATOR="|">
		<TR><![CDATA[CEO| 임원|대표이사|황정열|남|50대|서울|50|15|10122200|1012220]]></TR>
		<TR><![CDATA[SI사업부| 임원|상무|강대호|남|40대|경기|47|15|6756170|675617]]></TR>
		<TR><![CDATA[SI사업부|개발1팀|부장|김미경|여|30대|강원|39|12|4180950|418095]]></TR>
		<TR><![CDATA[SI사업부|개발1팀|과장|김선희|여|30대|경기|34|7|3217000|321700]]></TR>
		<TR><![CDATA[SI사업부|개발1팀|과장|최세희|여|30대|경기|32|3|2750800|275080]]></TR>
		<TR><![CDATA[SI사업부|개발1팀|대리|이명희|여|20대|서울|29|3|2571900|257190]]></TR>
		<TR><![CDATA[SI사업부|개발1팀|사원|노효일|남|20대|서울|23|1|1520150|152020]]></TR>
		<TR><![CDATA[SI사업부|개발1팀|사원|원영국|남|20대|경기|28|2|2557000|255700]]></TR>
		<TR><![CDATA[SI사업부|개발1팀|사원|이지선|여|20대|서울|24|2|2007500|200750]]></TR>
		<TR><![CDATA[인사부|인사1팀|부장|김상도|남|40대|경기|40|9|4290850|429085]]></TR>
		<TR><![CDATA[인사부|인사1팀|대리|한보라|여|20대|서울|28|5|1959500|195950]]></TR>
		<TR><![CDATA[인사부|인사2팀|사원|장태우|남|20대|서울|28|1|1959500|195950]]></TR>
		<TR><![CDATA[인사부|인사2팀|차장|정필석|남|40대|경기|40|4|3851150|385120]]></TR>
		<TR><![CDATA[솔루션사업부| 임원|이사|조성목|남|40대|경기|41|15|6313700|631370]]></TR>
		<TR><![CDATA[솔루션사업부|개발1팀|부장|유봉근|남|40대|서울|42|5|5187610|518760]]></TR>
		<TR><![CDATA[솔루션사업부|개발1팀|차장|오필환|남|30대|서울|37|4|3412510|341250]]></TR>
		<TR><![CDATA[솔루션사업부|개발1팀|차장|송복석|남|30대|경기|39|6|3871680|387170]]></TR>
		<TR><![CDATA[솔루션사업부|개발1팀|과장|김남연|남|30대|서울|36|4|3500700|350070]]></TR>
		<TR><![CDATA[솔루션사업부|개발1팀|대리|한혜선|여|20대|서울|29|2|2746000|274600]]></TR>
		<TR><![CDATA[솔루션사업부|개발1팀|사원|조미미|여|20대|서울|25|2|2297040|229700]]></TR>
		<TR><![CDATA[솔루션사업부|개발1팀|사원|고은혜|여|20대|서울|26|1|2390740|239070]]></TR>
		<TR><![CDATA[솔루션사업부|개발1팀|사원|성열|남|20대|서울|27|1|2409000|240900]]></TR>
		<TR><![CDATA[솔루션사업부|개발1팀|사원|김영중|여|20대|인천|28|3|2871100|287110]]></TR>
		<TR><![CDATA[솔루션사업부|개발2팀|부장|김명호|남|30대|서울|38|8|3709800|370980]]></TR>
		<TR><![CDATA[솔루션사업부|개발2팀|사원|하태선|남|20대|서울|28|1|2415010|241500]]></TR>
		<TR><![CDATA[솔루션사업부|영업팀|사원|김정민|남|30대|경기|32|3|2989010|298900]]></TR>
		<TR><![CDATA[솔루션사업부|기술지원팀|차장|장성훈|남|30대|서울|37|5|3880150|388020]]></TR>
		<TR><![CDATA[솔루션사업부|기술지원팀|차장|강윤식|남|30대|서울|35|7|3855600|385560]]></TR>
		<TR><![CDATA[솔루션사업부|기술지원팀|대리|김수연|여|30대|경기|30|1|2698800|269880]]></TR>
		<TR><![CDATA[솔루션사업부|기술지원팀|대리|정은지|여|30대|서울|30|1|2698800|269880]]></TR>
		<TR><![CDATA[영업팀|영업1팀|사원|정창호|남|20대|서울|27|1|1897500|189750]]></TR>
		<TR><![CDATA[영업팀|영업2팀|대리|김대현|남|30대|서울|33|5|2709800|270980]]></TR>
		<TR><![CDATA[기술연구소|연구1팀|소장|안남주|여|30대|서울|38|10|4891350|489140]]></TR>
		<TR><![CDATA[기술연구소|연구1팀|차장|이민수|남|30대|경기|38|8|3845010|384500]]></TR>
		<TR><![CDATA[기술연구소|연구1팀|차장|최갑석|남|30대|경기|38|5|3500700|350070]]></TR>
		<TR><![CDATA[기술연구소|연구1팀|차장|김태헌|남|30대|경기|37|6|3489000|348900]]></TR>
		<TR><![CDATA[기술연구소|연구1팀|과장|박정석|남|30대|서울|32|3|2885000|288500]]></TR>
		<TR><![CDATA[기술연구소|연구1팀|과장|권기윤|남|30대|경기|37|7|3450100|345010]]></TR>
		<TR><![CDATA[경영지원팀|경영1팀|차장|김승운|남|30대|경기|39|2|3505700|350570]]></TR>
		<TR><![CDATA[경영지원팀|경영1팀|사원|이해영|여|20대|경기|23|1|1800800|180080]]></TR>
	</DATA>
</SHEET>